Repository: JulianGro/vircadia-docs-sphinx
Catalog: docs/source/locales/*/LC_MESSAGES/developer.po
Languages: fr

source: Note: You can also run Interface by launching it from command line or File Explorer from %VIRCADIA_DIR%\build\interface\Release\interface.exe
fr: Note : Vous pouvez également exécuter Interface en la lançant en ligne de commande ou l'explorateur de fichiers à partir de %VIRCADIA_DIR%\build\interface\Release\interface.exe

source: For any problems after Step #6, first try this:
fr: Pour tout problème après l'étape 6, essayez d'abord ceci :

source: Delete your locally cloned copy of the Vircadia repository
fr: Supprimez votre copie clonée localement du référentiel Vircadia

source: Restart your computer
fr: Redémarrez votre ordinateur

source: Redownload the repository
fr: Téléchargez le référentiel

source: Restart directions from Step #6
fr: Reprennez les instructions depuis l'étape 6

source: CMake gives you the same error message repeatedly after the build fails
fr: CMake vous donne le même message d'erreur à plusieurs reprises après l'échouement de la compilation

source: Remove CMakeCache.txt found in the %VIRCADIA_DIR%\build directory.
fr: Supprimez CMakeCache.txt qui se trouve dans le répertoire %VIRCADIA_DIR%\build.

source: CMake can't find OpenSSL
fr: CMake ne trouve pas OpenSSL

source: Remove CMakeCache.txt found in the %VIRCADIA_DIR%\build directory. Verify that your HIFI_VCPKG_BASE environment variable is set and pointing to the correct location. Verify that the file ${HIFI_VCPKG_BASE}/installed/x64-windows/include/openssl/ssl.h exists.
fr: Supprimez le fichier CMakeCache.txt qui se trouve dans le répertoire %VIRCADIA_DIR%\build. Vérifiez que votre variable d'environnement HIFI_VCPKG_BASE est définie et qu'elle pointe vers le bon emplacement. Vérifiez que le fichier ${HIFI_VCPKG_BASE}/installed/x64-windows/include/openssl/ssl.h existe.

source: Environment Variables
fr: Variables d'Environnement

source: You can launch a domain-server with these parameters.
fr: Vous pouvez lancer un serveur de domaine avec ces paramètres.

source: ICE server address
fr: Adresse du serveur ICE

source: Domain server UUID
fr: Serveur de domaine UUID

source: Requests a temporary domain name
fr: Demande un nom de domaine temporaire

source: User config file path
fr: Chemin d'accès au fichier de configuration de l'utilisateur

source: Displays the PID of the parent process
fr: Affiche le NID de la procédure parentale

source: You can alter the Domain server's functionality using the following environment variables.
fr: Vous pouvez modifier la fonctionnalité du serveur de domaine en utilisant les variables d'environnement suivantes.

source: Override the default port for your Domain server.
fr: Remplacez le port par défaut de votre serveur de domaine.

source: Override the default DTLS port.
fr: Remplacer le port par défaut de DTLS.

source: Override the default HTTP port.
fr: Remplacer le port HTTP par défaut.

source: Override the default HTTPS port.
fr: Remplacer le port HTTPS par défaut.

source: Override the default statistics exporter port.
fr: Remplacez le port par défaut de l'exportateur de statistiques.

source: Override the default metadata exporter port.
fr: Remplacez le port par défaut de l'exportateur de métadonnées.

source: Installer Creation Guide
fr: Guide de Création de l'Installateur

source: Creating an Installer
fr: Création d'un installateur

source: An installer for Interface and Sandbox can be generated. This installer is made with NSIS.
fr: Un installateur pour l'Interface et Sandbox peut être généré. Cet installateur est réalisé avec NSIS.

source: Last Updated on August 24, 2020
fr: Dernière mise à jour le 24 août 2020

source: Follow the build guide to figure out how to build Vircadia for your platform.
fr: Suivez le guide de compilation pour savoir comment compiler Vircadia pour votre plateforme.

source: During generation, CMake should produce an install target and a package target.
fr: Lors de la génération, CMake doit produire une cible d'installation et une cible d' empaquetage.

source: The install target will copy the Vircadia targets and their dependencies to your CMAKE_INSTALL_PREFIX.<br />This variable is set by the project(hifi) command in CMakeLists.txt to C:/Program Files/hifi and stored in build/CMakeCache.txt
fr: La cible d'installation va copier les cibles Vircadia et leurs dépendances dans votre CMAKE_INSTALL_PREFIX.<br />Cette variable est définie par la commande project(hifi) dans CMakeLists.txt à C:/Program Files/hifi et stockée dans build/CMakeCache.txt

source: Packaging
fr: Empaquetage

source: To produce an installer, run the package target. However you will want to follow the steps specific to your platform below.
fr: Pour produire un installateur, lancez la cible d' empaquetage. Cependant, vous devrez suivre les étapes spécifiques à votre plate-forme ci-dessous.

source: Prerequisites
fr: Conditions préalables

source: To produce an executable installer on Windows, the following are required:
fr: Pour produire un programme d'installation exécutable sous Windows, les éléments suivants sont nécessaires :

source: Nullsoft Scriptable Install System - 3.04<br />Install using defaults (will install to C:\Program Files (x86)\NSIS)
fr: Nullsoft Scriptable Install System - 3.04<br />Installation en utilisant les valeurs par défaut (installera dans C:\Program Files (x86)\NSIS)

source: UAC Plug-in for Nullsoft - 0.2.4c
fr: Plug-in UAC pour Nullsoft - 0.2.4c

source: Extract Zip
fr: Extrait Zip

source: Copy UAC.nsh to C:\Program Files (x86)\NSIS\Include\
fr: Copiez UAC.nsh dans C:\Program Files (x86)\NSIS\Include\

source: Copy Plugins\x86-ansi\UAC.dll to C:\Program Files (x86)\NSIS\Plugins\x86-ansi\
fr: Copiez Plugins\x86-ansi\UAC.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-ansi\

source: Copy Plugins\x86-unicode\UAC.dll to C:\Program Files (x86)\NSIS\Plugins\x86-unicode\
fr: Copiez Plugins\x86-unicode\UAC.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-unicode\

source: nsProcess Plug-in for Nullsoft - 1.6 (use the link marked nsProcess_1_6.7z)
fr: nsProcess Plug-in for Nullsoft - 1.6 (utilise le lien marqué nsProcess_1_6.7z)

source: Copy Include\nsProcess.nsh to C:\Program Files (x86)\NSIS\Include\
fr: Copiez Include\nsProcess.nsh dans C:\Program Files (x86)\NSIS\Include\

source: Copy Plugins\nsProcess.dll to C:\Program Files (x86)\NSIS\Plugins\x86-ansi\
fr: Copiez Plugins\nsProcess.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-ansi\

source: Copy Plugins\nsProcessW.dll to C:\Program Files (x86)\NSIS\Plugins\x86-unicode\
fr: Copiez Plugins\nsProcessW.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-unicode\

source: InetC Plug-in for Nullsoft - 1.0
fr: Plug-in InetC pour Nullsoft - 1.0

source: Copy Plugin\x86-ansi\InetC.dll to C:\Program Files (x86)\NSIS\Plugins\x86-ansi\
fr: Copiez Plugin\x86-ansi\InetC.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-ansi\

source: Copy Plugin\x86-unicode\InetC.dll to C:\Program Files (x86)\NSIS\Plugins\x86-unicode\
fr: Copiez Plugin\x86-unicode\InetC.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-unicode\

source: NSISpcre Plug-in for Nullsoft - 1.0
fr: NSISpcre Plug-in pour Nullsoft - 1.0

source: Copy NSISpre.nsh to C:\Program Files (x86)\NSIS\Include\
fr: Copiez NSISpre.nsh dans C:\Program Files (x86)\NSIS\Include\

source: Copy NSISpre.dll to C:\Program Files (x86)\NSIS\Plugins\x86-ansi\
fr: Copiez NSISpre.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-ansi\

source: nsisSlideshow Plug-in for Nullsoft - 1.7
fr: nsisSlideshow Plug-in pour Nullsoft - 1.7

source: Copy bin\nsisSlideshow.dll to C:\Program Files (x86)\NSIS\Plugins\x86-ansi\
fr: Copiez bin\nsisSlideshow.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-ansi\

source: Copy bin\nsisSlideshowW.dll to C:\Program Files (x86)\NSIS\Plugins\x86-unicode\
fr: Copiez bin\nsisSlideshowW.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-unicode\

source: Nsisunz plug-in for Nullsoft
fr: Plug-in Nsisunz pour Nullsoft

source: Download both Zips and unzip
fr: Téléchargez les deux Zips et dézippez

source: Copy nsisunz\Release\nsisunz.dll to C:\Program Files (x86)\NSIS\Plugins\x86-ansi\
fr: Copiez nsisunz\Release\nsisunz.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-ansi\

source: Copy NSISunzU\Plugin unicode\nsisunz.dll to C:\Program Files (x86)\NSIS\Plugins\x86-unicode\
fr: Copiez NSISunzU\Plugin unicode\nsisunz.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-unicode\

source: ApplicationID plug-in for Nullsoft - 1.0
fr: Plug-in ApplicationID pour Nullsoft - 1.0

source: Download Pre-built DLLs
fr: Télécharger les DLLs pré-compilées

source: Copy Release\ApplicationID.dll to C:\Program Files (x86)\NSIS\Plugins\x86-ansi\
fr: Copiez Release\ApplicationID.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-ansi\

source: Copy ReleaseUnicode\ApplicationID.dll to C:\Program Files (x86)\NSIS\Plugins\x86-unicode\
fr: Copiez ReleaseUnicode\ApplicationID.dll dans C:\Program Files (x86)\NSIS\Plugins\x86-unicode\

source: Node.JS and NPM
fr: Node.JS et NPM

source: Install version 10.15.0 LTS
fr: Installez la version 10.15.0 LTS

source: Code Signing (optional)
fr: Signature du Code (facultatif)

source: For code signing to work, you will need to set the HF_PFX_FILE and HF_PFX_PASSPHRASE environment variables to be present during CMake runtime and globally as we proceed to package the installer.
fr: Pour que la signature de code fonctionne, vous devrez définir les variables d'environnement HF_PFX_FILE et HF_PFX_PASSPHRASE de manière à ce qu'elles soient présentes pendant l'exécution de CMake et globalement lorsque nous procédons à l'installation.

source: Creating the Installer
fr: Création de l'Installateur

source: Perform a clean cmake from a new terminal.
fr: Effectuez un cmake propre à partir d'un nouveau terminal.

source: Open the vircadia.sln solution with elevated (administrator) permissions on Visual Studio and select the Release configuration.
fr: Ouvrez la solution vircadia.sln avec des autorisations élevées (administrateur) pour Visual Studio et sélectionnez la configuration Release.

source: Build the solution.
fr: Compilez la solution.

source: Build packaged-server-console-npm-install (found under hidden/Server Console)
fr: Compilez packaged-server-console-npm-install (se trouvant sous hidden/Server Console)

source: Build packaged-server-console (found under Server Console)<br />This will add 2 folders to build\server-console\ -<br />server-console-win32-x64 and x64
fr: Compilez packaged-server-console (trouvé sous Server Console)<br />Cela ajoutera 2 dossiers à build\server-console\ -<br />server-console-win32-x64 et x64

source: Build CMakeTargets->PACKAGE<br />The installer is now available in build\_CPack_Packages\win64\NSIS
fr: Compilez CMakeTargets->PACKAGE<br />L'installateur est maintenant disponible dans build\_CPack_Packages\win64\NSIS

source: Perform a clean CMake.
fr: Effectuez un CMake propre.

source: Perform a Release build of ALL_BUILD
fr: Effectuez un Release build de ALL_BUILD

source: Perform a Release build of packaged-server-console This will add a folder to build\server-console\ -<br />Sandbox-darwin-x64
fr: Effectuez une compilation Release de packaged-server-console Cela ajoutera un dossier à build\server-console\ -<br />Sandbox-darwin-x64

source: Perform a Release build of package Installer is now available in `build/_CPack_Packages/Darwin/DragNDrop
fr: Effectuez une compilation Release de package Installer est maintenant disponible dans `build/_CPack_Packages/Darwin/DragNDrop

source: Problem: Failure to open a file. File: failed opening file "\FOLDERSHARE\XYZSRelease\...\Credits.rtf" Error in script "C:\TFS\XYZProject\Releases\NullsoftInstaller\XYZWin7Installer.nsi" on line 77 -- aborting creation process
fr: Problème : Non ouverture d'un dossier. failed opening file "\FOLDERSHARE\XYZSRelease\...\Credits.rtf" Error in script "C:\TFS\XYZProject\Releases\NullsoftInstaller\XYZWin7Installer.nsi" on line 77 -- aborting creation process

source: Cause: The complete path (current directory + relative path) has to be < 260 characters to any of the relevant files.
fr: Cause : Le chemin complet (répertoire actuel + chemin relatif) doit comporter < 260 caractères pour tous les fichiers concernés.

source: Solution: Move your build and packaging folder as high up in the drive as possible to prevent an overage.
fr: Solution : Déplacez votre dossier de compilation et d'empaquetage aussi haut que possible dans le lecteur pour éviter un surnombre.

source: Debugging
fr: Débogage

source: You can launch Interface with the following parameters.
fr: Vous pouvez lancer Interface avec les paramètres suivants.

source: Displays help dialog
fr: Affiche le dialogue d'aide

source: Start up at specified URL location
fr: Démarrage à l'emplacement URL spécifié

source: Displays the protocol version
fr: Affiche la version du protocole

source: Do not show the auto-updater
fr: Ne pas montrer la mise à jour automatique

source: Checks to see if the machine meets the minimum specification requirements.
fr: Vérifie la conformité de la machine aux spécifications minimales.

source: Whether to run the server
fr: Exécution ou non du serveur

source: Port to listen on. (Needs clarification!)
fr: Port à écouter. (Nécessite une clarification !)

source: Where to find server content
fr: Où trouver le contenu du serveur

source: Set cache location. Defaults to the operating system local data path.
fr: Définit l'emplacement du cache. Par défaut, le chemin d'accès pour les données locales du système d'exploitation.

source: Set path for defaultScripts.
fr: Définit le chemin d'accès pour les scripts par défaut.

source: Allow multiple instances of the interface to run simultaneously.
fr: Permet à plusieurs instances de l'interface de s'exécuter simultanément.

source: Preferred displays.
fr: Affichages préférés.

source: Disable display plugin. Possible devices include "OpenVR (Vive)", "Oculus Rift".
fr: Désactive le plugin d'affichage. Les périphériques possibles sont "OpenVR (Vive)", "Oculus Rift".

source: Disable input plugin. Possible devices include "OpenVR (Vive)", "Oculus Rift".
fr: Désactive le plugin d'entrée. Les périphériques possibles sont "OpenVR (Vive)", "Oculus Rift".

source: Suppress the prompt to reset interface settings
fr: Supprime l'invite à réinitialiser les paramètres de l'interface

source: Let the Oculus plugin know if Interface was run from the Oculus Store
fr: Fait savoir au plugin Oculus si l'interface a été exécutée à partir de l'Oculus Store

source: Emulate a standalone device
fr: Émule un appareil autonome

source: Disable the watchdog thread. The interface will crash on deadlocks.
fr: Désactive le thread de garde. L'interface se plantera en cas de blocage.

source: (Needs clarification!)
fr: (Nécessite une clarification !)

source: Maximum concurrent resource downloads. Default is 16, except for Android where it is 4.
fr: Maximum de téléchargements de ressources simultanés. La valeur par défaut est de 16, sauf pour Android où elle est de 4.

source: Override the avatar URL
fr: Remplace l'URL de l'avatar

source: Replaces the Avatar URL. If both this and --avatarURL is set, this one takes precedence.
fr: Remplace l'URL de l'avatar. Si cette URL et --avatarURL sont toutes deux définies, celle-ci a la priorité.

source: Bookmarks are expected to be in a name=url form. An = character in the name or url is unsupported.
fr: Les signets doivent se présenter sous la forme name=url. Un caractère = dans le nom ou l'url n'est pas pris en charge.

source: Disable level of detail auto config.
fr: Désactive la configuration automatique du niveau de détail.

source: Debugging Tips
fr: Conseils de débogage

source: To run Interface from Visual Studio with the debugger attached you need to set Interface as the startup project. To do this, in Solution Explorer, expand the "Apps" folder, right click interface, and select "Set as Startup Project". Now Debug > Start Debugging and the Local Windows Debugger button on the debug toolbar will start Interface.
fr: Pour exécuter Interface à partir de Visual Studio avec le débogueur attaché, vous devez définir Interface comme projet de démarrage. Pour ce faire, dans Solution Explorer, développez le dossier "Apps", cliquez avec le bouton droit de la souris sur Interface et sélectionnez "Set as Startup Project". Maintenant Debug > Start Debugging et le bouton Local Windows Debugger de la barre d'outils de débogage lancera Interface.

source: If you do not set the startup project to Interface, the debugger will try to start ALL_BUILD under the "CMakeTargets" folder, resulting in an "Access is Denied" error.
fr: Si vous ne définissez pas le projet de démarrage comme Interface, le débogueur essaiera de lancer ALL_BUILD sous le dossier "CMakeTargets", ce qui entraînera une erreur "Access is Denied".

source: You can alter Interface's functionality using the following environment variables.
fr: Vous pouvez modifier la fonctionnalité d'Interface en utilisant les variables d'environnement suivantes.

source: Use the source files for QML and other resources at runtime instead of the compiled files.
fr: Utilise les fichiers sources pour QML et d'autres ressources au moment de l'exécution au lieu des fichiers compilés.

source: Enable the HMD debugging mode which emulates an HMD view in 2D for desktop testing.
fr: Active le mode de débogage HMD qui émule une vue HMD en 2D pour les tests en mode Clavier.

source: Enable the OpenVR plugin to be used with an Oculus HMD. (Useful for debugging the OpenVR plugin if you have an Oculus HMD but not a SteamVR HMD.)
fr: Active le plugin OpenVR pour qu'il soit utilisé avec un HMD Oculus. (Utile pour déboguer le plugin OpenVR si vous avez un HMD Oculus mais pas un HMD SteamVR)

source: Override the metaverse URL.
fr: Remplace l'URL du métaverse.

source: Allow multiple instances of Interface to run simultaneously.
fr: Permet à plusieurs instances de l'Interface de s'exécuter simultanément.

source: Logging to the console can be controlled with the VIRCADIA_LOG_OPTIONS variable. It can be set to any comma separated combination of the following options. Case and whitespace are not significant.
fr: La connexion à la console peut être contrôlée avec la variable VIRCADIA_LOG_OPTIONS. Elle peut être configurée pour toute combinaison des options suivantes, séparées par des virgules. Les majuscules et les espaces ne sont pas significatifs.

source: color - Force ANSI colors depending on the message's severity.
fr: color - Force les couleurs ANSI en fonction de la gravité du message.

source: nocolor - Force ANSI colors off.
fr: nocolor - Désactive les couleurs ANSI.

source: milliseconds - Log timestamps with millisecond precision.
fr: milliseconds - Enregistre les horodatages avec une précision de l'ordre de la milliseconde.

source: process_id - Log the process ID.
fr: process_id - Enregistre l'ID du processus.

source: thread_id - Log the thread ID.
fr: thread_id - Enregistre l'ID du thread.

source: For example:
fr: Par exemple :

source: This will cause logging with millisecond precision, and color coding messages by severity.
fr: Ceci permet d'enregistrer avec une précision de l'ordre de la milliseconde et de coder les messages par couleur en fonction de leur gravité.

source: Will result in only millisecond precision being applied to logging.
fr: La précision de la journalisation sera alors de l'ordre de la milliseconde.

source: Color is enabled by default on Unix if output is being directed to a terminal, and disabled by default on Windows.
fr: La couleur est activée par défaut sous Unix si la sortie est dirigée vers un terminal, et désactivée par défaut sous Windows.
