Repository: JulianGro/vircadia-docs-sphinx
Catalog: docs/source/locales/*/LC_MESSAGES/developer.po
Languages: fr

source: Please read the general build guide for information on dependencies required for all platforms. Only Linux specific instructions are found in this file.
fr: Veuillez lire le guide général de compilation pour obtenir des informations sur les dépendances requises pour toutes les plateformes. Seules les instructions spécifiques à Linux se trouvent dans ce fichier.

source: You can use the Vircadia Builder to build on Linux more easily. Alternatively, you can follow the manual steps below.
fr: Vous pouvez utiliser le Vircadia Builder pour compiler sur Linux plus facilement. Vous pouvez également suivre les étapes du manuel ci-dessous.

source: Ubuntu 16.04/18.04 specific build guide
fr: Guide de compilation spécifique à Ubuntu 16.04/18.04

source: Ubuntu 16.04 only
fr: Ubuntu 16.04 seulement

source: Add the following line to .bash_profile<br />export QT_QPA_FONTDIR=/usr/share/fonts/truetype/dejavu/
fr: Ajouter la ligne suivante à .bash_profile<br />export QT_QPA_FONTDIR=/usr/share/fonts/truetype/dejavu/

source: Ubuntu 18.04 server only
fr: Serveur Ubuntu 18.04 uniquement

source: Add the universe repository:<br />(This is not enabled by default on the server edition)
fr: Ajouter le répertoire de l'univers:<br />(Ceci n'est pas activé par défaut sur l'édition du serveur)

source: Install build tools:
fr: Installer des outils de compilation :

source: First update the repositories:
fr: Mettez d'abord à jour les répertoires :

source: Verify by git --version
fr: Vérifier par git --version

source: Verify by g++ --version
fr: Vérifier par g++ --version

source: Verify by cmake --version
fr: Vérifier par cmake --version

source: Install build dependencies:
fr: Installer des dépendances de compilation :

source: Verify with openssl version
fr: Vérifier avec openssl version

source: Verify OpenGL:
fr: Vérifier OpenGL :

source: First install mesa-utils with the command sudo apt install mesa-utils -y
fr: Installez d'abord mesa-utils avec la commande sudo apt install mesa-utils -y

source: Then run glxinfo | grep "OpenGL version"
fr: Puis lancez glxinfo | grep "OpenGL version"

source: To compile interface in a server you must install:
fr: Pour compiler l'interface dans un serveur, vous devez installer :

source: Misc dependencies:
fr: Diverses dépendances :

source: Install Python 3 and required packages:
fr: Installez Python 3 et les paquets nécessaires :

source: Install node, required to build the jsdoc documentation:
fr: Installez node, nécessaire pour compiler la documentation jsdoc :

source: Get code and checkout the branch you need
fr: Obtenez le code et extrayez la branche dont vous avez besoin

source: Clone this repository:
fr: Clonez ce répertoire :

source: To compile a DEV version checkout the branch you need. To get a list of all tags:
fr: Pour compiler une version DEV, extrayez la branche dont vous avez besoin. Pour obtenir une liste de tous les tags :

source: Then checkout the main branch with:
fr: Ensuite, vous pouvez extraire la branche principale avec :

source: Using a custom Qt build
fr: Utiliser une compilation Qt personnalisée

source: Qt binaries are only provided for Ubuntu. In order to build on other distributions, a Qt5 install needs to be provided as follows:
fr: Les binaires Qt ne sont fournis que pour Ubuntu. Afin de compiler sur d'autres distributions, une installation de Qt5 doit être fournie comme suit :

source: Set VIRCADIA_USE_PREBUILT_QT=1
fr: Définissez VIRCADIA_USE_PREBUILT_QT=1

source: Set VIRCADIA_USE_QT_VERSION to the Qt version (defaults to 5.12.3)
fr: Définissez VIRCADIA_USE_QT_VERSION sur la version Qt (par défaut 5.12.3)

source: Set HIFI_QT_BASE=/path/to/qt
fr: Définissez HIFI_QT_BASE=/path/to/qt

source: Qt must be installed in $HIFI_QT_BASE/$VIRCADIA_USE_QT_VERSION/qt5-install.
fr: Qt doit être installé dans $HIFI_QT_BASE/$VIRCADIA_USE_QT_VERSION/qt5-install.

source: Compiling
fr: Compilation

source: Create the build directory:
fr: Créez le répertoire de compilation :

source: Prepare makefiles:
fr: Préparez les makefiles :

source: If cmake fails with a vcpkg error - delete /tmp/hifi/vcpkg.
fr: Si cmake échoue avec une erreur vcpkg - supprimez /tmp/hifi/vcpkg.

source: Start compilation of the server and get a cup of coffee:
fr: Lancez la compilation du serveur et prenez une tasse de café :

source: To compile interface:
fr: Compiler l'interface :

source: The commands above will compile with a single thread. If you have enough memory, you can decrease your build time using the -j flag. Since most x64 CPUs support two threads per core, this works out to CPU_COUNT*2. As an example, if you have a 2 core machine, you could use:
fr: Les commandes ci-dessus se compilent avec un seul thread. Si vous avez suffisamment de mémoire, vous pouvez réduire votre temps de compilation en utilisant l'option -j. Comme la plupart des processeurs x64 supportent deux threads par core, cela correspond à CPU_COUNT*2. Par exemple, si vous avez une machine à deux cores, vous pouvez utiliser :

source: In a server, it does not make sense to compile interface.
fr: Dans un serveur, cela ne fait pas de sense de compiler l'interface.

source: Running the software
fr: Exécution du logiciel

source: Domain server
fr: Serveur de domaine

source: Running domain server:
fr: Exécution du serveur de domaine :

source: Assignment clients
fr: Clients d'Assignation

source: Running assignment client:
fr: Exécution d'un client d'assignation :

source: Running interface:
fr: Exécution de l'interface :

source: Go to localhost in the running interface.
fr: Aller à localhost dans l'interface en cours d'exécution.

source: If your goal is to set up a development environment, it is desirable to set the directory that vcpkg builds into with the HIFI_VCPKG_BASE environment variable. For example, you might set HIFI_VCPKG_BASE to /home/$USER/vcpkg. By default, vcpkg will build in the system /tmp directory.
fr: Si votre objectif est de mettre en place un environnement de développement, il est souhaitable de définir le répertoire dans lequel vcpkg s'intègre avec la variable d'environnement HIFI_VCPKG_BASE. Par exemple, vous pouvez saisir la variable HIFI_VCPKG_BASE avec la valeur /home/$USER/vcpkg. Par défaut, vcpkg sera intégré dans le répertoire /tmp du système.

source: Ubuntu 18.04 only
fr: Ubuntu 18.04 seulement

source: In Ubuntu 18.04 there is a problem related with NVidia driver library version.
fr: Dans Ubuntu 18.04, il y a un problème lié à la version de la bibliothèque de pilotes NVidia.

source: It can be worked around following these steps:
fr: Il peut être contourné en suivant ces étapes :

source: Uninstall incompatible nvtt libraries:<br />sudo apt-get remove libnvtt2 libnvtt-dev
fr: Désinstallez les bibliothèques nvtt incompatibles:<br />sudo apt-get remove libnvtt2 libnvtt-dev

source: Install libssl1.0-dev:<br />sudo apt-get -y install libssl1.0-dev
fr: Installez libssl1.0-dev:<br />sudo apt-get -y install libssl1.0-dev

source: Clone castano nvidia-texture-tools:<br />git clone https://github.com/castano/nvidia-texture-tools<br />cd nvidia-texture-tools/
fr: Clonez castano nvidia-texture-tools:<br />git clone https://github.com/castano/nvidia-texture-tools<br />cd nvidia-texture-tools/

source: Make these changes in repo:
fr: Apporter ces changements dans les référentiels :

source: In file VERSION set 2.2.1
fr: Dans le fichier VERSION fixez à 2.2.1

source: In file configure:
fr: Dans le fichier configure :

source: set build="release"
fr: mettez build="release"

source: set -DNVTT_SHARED=1
fr: mettez -DNVTT_SHARED=1

source: Configure, build and install:<br />./configure<br />make<br />sudo make install
fr: Configurez, compilez and installez:<br />./configure<br />make<br />sudo make install

source: Link compiled files:<br />sudo ln -s /usr/local/lib/libnvcore.so /usr/lib/libnvcore.so<br />sudo ln -s /usr/local/lib/libnvimage.so /usr/lib/libnvimage.so<br />sudo ln -s /usr/local/lib/libnvmath.so /usr/lib/libnvmath.so<br />sudo ln -s /usr/local/lib/libnvtt.so /usr/lib/libnvtt.so
fr: Reliez les fichiers compilés:<br />sudo ln -s /usr/local/lib/libnvcore.so /usr/lib/libnvcore.so<br />sudo ln -s /usr/local/lib/libnvimage.so /usr/lib/libnvimage.so<br />sudo ln -s /usr/local/lib/libnvmath.so /usr/lib/libnvmath.so<br />sudo ln -s /usr/local/lib/libnvtt.so /usr/lib/libnvtt.so

source: After running these steps you can run interface:<br />interface/interface
fr: Après avoir effectué ces étapes, vous pouvez lancer l'interface:<br />interface/interface

source: Please read the general build guide for information on dependencies required for all platforms. Only macOS specific instructions are found in this document.
fr: Veuillez lire le guide général de compilation pour obtenir des informations sur les dépendances requises pour toutes les plateformes. Seules les instructions spécifiques à MacOS se trouvent dans ce document.

source: Homebrew is an excellent package manager for macOS. It makes install of some Vircadia dependencies very simple.
fr: Homebrew est un excellent gestionnaire de paquets pour macOS. Il rend l'installation de certaines dépendances de Vircadia très simple.

source: Download an install Python 3.6.6 or higher from here.<br />Execute the Update Shell Profile.command script that is provided with the installer.
fr: Téléchargez une installation de Python 3.6.6 ou supérieur à partir d'ici.<br />Execute the Update Shell Profile.command script qui est fourni avec l'installateur.

source: OSX SDK
fr: SDK OSX

source: You will need version 10.12 of the OSX SDK for building, otherwise you may have crashing or other unintended issues due to the deprecation of OpenGL on OSX. You can get that SDK from here. You must copy it in to your Xcode SDK directory, e.g.
fr: Vous aurez besoin de la version 10.12 du SDK OSX pour la compilation, sinon vous risquez d'avoir un plantage ou d'autres problèmes involontaires dus à la dépréciation d'OpenGL sur OSX. Vous pouvez obtenir ce SDK ici. Vous devez le copier dans votre répertoire SDK Xcode, par exemple.

source: Assuming you've installed OpenSSL using the homebrew instructions above, you'll need to set OPENSSL_ROOT_DIR so CMake can find your installations.<br />For OpenSSL installed via homebrew, set OPENSSL_ROOT_DIR via export OPENSSL_ROOT_DIR=/usr/local/opt/openssl or by appending -DOPENSSL_ROOT_DIR=/usr/local/opt/openssl to cmake
fr: En supposant que vous avez installé OpenSSL en utilisant les instructions homebrew ci-dessus, vous devrez définir OPENSSL_ROOT_DIR pour que CMake puisse trouver vos installations.<br />Pour OpenSSL installé via homebrew, définissez OPENSSL_ROOT_DIR via export OPENSSL_ROOT_DIR=/usr/local/opt/openssl ou en ajoutant -DOPENSSL_ROOT_DIR=/usr/local/opt/openssl à cmake

source: You can ask CMake to generate Xcode project files instead of Unix Makefiles using the -G Xcode parameter after CMake. You will need to select the Xcode installation in the terminal first if you have not done so already.
fr: Vous pouvez demander à CMake de générer des fichiers de projet Xcode au lieu de Makefiles Unix en utilisant le paramètre -G Xcode après CMake. Vous devrez d'abord sélectionner l'installation de Xcode dans le terminal si vous ne l'avez pas déjà fait.

source: If cmake complains about Python 3 being missing, you may need to update your CMake binary with command brew upgrade cmake, or by downloading and running the latest CMake installer, depending on how you originally instaled CMake
fr: Si cmake se plaint de l'absence de Python 3, vous devrez peut-être mettre à jour votre binaire CMake avec la commande brew upgrade cmake, ou en téléchargeant et en exécutant le dernier installateur CMake, selon la façon dont vous avez installé CMake à l'origine

source: After running CMake, you will have the make files or Xcode project file necessary to build all of the components. Open the hifi.xcodeproj file, choose ALL_BUILD from the Product > Scheme menu (or target drop down), and click Run.
fr: Après avoir lancé CMake, vous aurez les fichiers make ou le fichier de projet Xcode nécessaires pour construire tous les composants. Ouvrez le fichier hifi.xcodeproj, choisissez ALL_BUILD dans le menu Product > Scheme (ou le menu déroulant target), et cliquez sur Run.

source: If the build completes successfully, you will have built targets for all components located in the build/${target_name}/Debug directories.
fr: Si la compilation se termine avec succès, vous aurez compilé des cibles pour tous les composants situés dans les répertoires build/${target_name}/Debug.

source: If you build with make rather than Xcode, you can append -j4 for assigning more threads. The number indicates the number of threads, e.g. 4.
fr: Si vous compilez avec make plutôt qu'avec Xcode, vous pouvez ajouter -j4 pour affecter plus de threads. Le chiffre indique le nombre de threads, par exemple 4.

source: To package the installation, you can simply run make package afterwards.
fr: Pour empaqueter l'installation, vous pouvez simplement exécutez make package par la suite.

source: Problem: Running the scheme interface.app from Xcode causes a crash for Interface related to libgl
fr: Problème : L'exécution du schéma interface.app à partir de Xcode provoque un plantage pour l'interface liée à libgl

source: Cause: The target gl generates a binary called libgl. A macOS libGL.framework item gets loaded instead by Xcode.
fr: Cause : La cible gl génère un binaire appelé libgl. Un élément macOS libGL.framework est chargé à la place par Xcode.

source: Solution: In the Xcode target settings for libgl, set the version to 1.0.0
fr: Solution : Dans les paramètres de la cible Xcode pour libgl, mettez la version à 1.0.0

source: Last Updated on May 17, 2020
fr: Dernière mise à jour le 17 mai 2020

source: This is a stand-alone guide for creating your first Vircadia build for Windows 64-bit.
fr: Ceci est un guide autonome pour la création de votre première version de Vircadia pour Windows 64 bits.

source: Note: We are now using Visual Studio 2017 or 2019 and Qt 5.12.3.<br />If you are upgrading from previous versions, do a clean uninstall of those versions before going through this guide.
fr: Remarque : nous utilisons actuellement Visual Studio 2017 ou 2019 et Qt 5.12.3.<br />Si vous effectuez une mise à niveau à partir de versions précédentes, effectuez une désinstallation propre de ces versions avant de parcourir ce guide.

source: Note: The prerequisites will require about 10 GB of space on your drive. You will also need a system with at least 8GB of main memory.
fr: Note : Les prérequis nécessiteront environ 10 Go d'espace sur votre disque. Vous aurez également besoin d'un système avec au moins 8 Go de mémoire principale.

source: Step 1. Visual Studio & Python 3.x
fr: Étape 1. Visual Studio & Python 3.x

source: If you don’t have Community or Professional edition of Visual Studio, download Visual Studio Community 2019. If you have Visual Studio 2017, you are not required to download Visual Studio 2019.
fr: Si vous ne disposez pas de l'édition Community ou Professional de Visual Studio, téléchargez Visual Studio Community 2019. Si vous avez Visual Studio 2017, vous n'êtes pas obligé de télécharger Visual Studio 2019.

source: When selecting components, check "Desktop development with C++". On the right on the Summary toolbar, select the following components.
fr: Lors de la sélection des composants, cochez "Desktop development with C++". À droite sur la barre d'outils Summary, sélectionnez les composants suivants.

source: If you're installing Visual Studio 2017,
fr: Si vous installez Visual Studio 2017,

source: Windows 8.1 SDK and UCRT SDK
fr: Windows 8.1 SDK et UCRT SDK

source: If you're installing Visual Studio 2019,
fr: Si vous installez Visual Studio 2019,

source: If you do not already have a Python 3.x development environment installed, also check "Python Development" in this screen.
fr: Si vous n'avez pas encore installé un environnement de développement Python 3.x, cochez également "Python Development" dans cet écran.

source: If you already have Visual Studio installed and need to add Python, open the "Add or remove programs" control panel and find the "Microsoft Visual Studio Installer". Select it and click "Modify". In the installer, select "Modify" again, then check "Python Development" and allow the installer to apply the changes.
fr: Si Visual Studio est déjà installé et que vous devez ajouter Python, ouvrez le panneau de configuration "Add or remove programs" et trouvez "Microsoft Visual Studio Installer". Sélectionnez-le et cliquez sur "Modify". Dans l'installateur, sélectionnez à nouveau "Modify", puis cochez "Python Development" et autorisez l'installateur à appliquer les modifications.

source: Step 1a. Alternate Python
fr: Étape 1a. Alternate Python

source: If you do not wish to use the Python installation bundled with Visual Studio, you can download the installer from here. Ensure you get version 3.6.6 or higher.
fr: Si vous ne souhaitez pas utiliser l'installation Python fournie avec Visual Studio, vous pouvez télécharger l'installateur ici. Assurez-vous d'obtenir la version 3.6.6 ou supérieure.

source: Step 2. Python Dependencies
fr: Étape 2. Dépendances de Python

source: In a command-line that can access Python's pip you will need to run the following command:
fr: Dans une ligne de commande qui peut accéder au pip de Python, vous devrez exécuter la commande suivante :

source: Step 3. Installing CMake
fr: Étape 3. Installation de CMake

source: Download and install the latest version of CMake 3.15.
fr: Téléchargez et installez la dernière version de CMake 3.15.

source: Note that earlier versions of CMake will work, but there is a specific bug related to the interaction of Visual Studio 2019 and CMake versions prior to 3.15 that will cause Visual Studio to rebuild far more than it needs to on every build
fr: Notez que les versions antérieures de CMake fonctionneront, mais il existe un bogue spécifique lié à l'interaction de Visual Studio 2019 et des versions de CMake antérieures à la version 3.15 qui fera que Visual Studio reconstruira beaucoup plus que nécessaire à chaque version

source: Download the file named win64-x64 Installer from the CMake Website. You can access the installer on this 3.15 Version page. During installation, make sure to check "Add CMake to system PATH for all users" when prompted.
fr: Téléchargez le fichier nommé win64-x64 Installer sur le site web de CMake. Vous pouvez accéder à l'installateur sur cette page de la version 3.15. Lors de l'installation, assurez-vous de cocher "Add CMake to system PATH for all users" lorsque vous y êtes invité.

source: Step 4. Create VCPKG environment variable
fr: Étape 4. Créer une variable d'environnement VCPKG

source: In the next step, you will use CMake to build Vircadia. By default, the CMake process builds dependency files in Windows' %TEMP% directory, which is periodically cleared by the operating system. To prevent you from having to re-build the dependencies in the event that Windows clears that directory, we recommend that you create a HIFI_VCPKG_BASE environment variable linked to a directory somewhere on your machine. That directory will contain all dependency files until you manually remove them.
fr: Dans l'étape suivante, vous utiliserez CMake pour compiler Vircadia. Par défaut, le processus CMake complie les fichiers de dépendance dans le répertoire %TEMP% de Windows, qui est périodiquement effacé par le système d'exploitation. Pour vous éviter d'avoir à recréer les dépendances dans le cas où Windows efface ce répertoire, nous vous recommandons de créer une variable d'environnement HIFI_VCPKG_BASE liée à un répertoire quelque part sur votre machine. Ce répertoire contiendra tous les fichiers de dépendances jusqu'à ce que vous les supprimiez manuellement.

source: To create this variable:
fr: Pour créer cette variable :

source: Naviagte to 'Edit the System Environment Variables' Through the start menu.
fr: Naviguez sur 'Edit the System Environment Variables' via le menu de démarrage.

source: Click on 'Environment Variables'
fr: Cliquez sur 'Environment Variables'

source: Select 'New'
fr: Sélectionnez 'New'

source: Set "Variable name" to HIFI_VCPKG_BASE
fr: Définissez "Variable name" sur HIFI_VCPKG_BASE

source: Set "Variable value" to any directory that you have control over.
fr: Mettez "Variable value" sur un répertoire dont vous avez le contrôle.

source: Additionally, if you have Visual Studio 2019 installed and only Visual Studio 2019 (i.e. you do not have Visual Studio 2017 installed) you must add an additional environment variable HIFI_VCPKG_BOOTSTRAP that will fix a bug in our vcpkg pre-build step.
fr: En outre, si vous avez installé Visual Studio 2019 et seulement Visual Studio 2019 (c'est-à-dire que vous n'avez pas installé Visual Studio 2017), vous devez ajouter une variable d'environnement supplémentaire HIFI_VCPKG_BOOTSTRAP qui corrigera un bogue dans notre étape de précompilation vcpkg.

source: Set "Variable name" to HIFI_VCPKG_BOOTSTRAP
fr: Définissez "Variable name" sur HIFI_VCPKG_BOOTSTRAP

source: Set "Variable value" to 1
fr: Mettez "Variable value" sur 1

source: Step 5. Running CMake to Generate Build Files
fr: Étape 5. Exécution de CMake pour Générer les Fichiers de Compilation

source: Run Command Prompt from Start and run the following commands:<br />cd "%VIRCADIA_DIR%"<br />mkdir build<br />cd build
fr: Démarrez Command Prompt depuis le menu Start et exécuter les commandes suivantes:<br />cd "%VIRCADIA_DIR%"<br />mkdir build<br />cd build

source: If you're using Visual Studio 2017,
fr: Si vous utilisez Visual Studio 2017,

source: Run cmake .. -G "Visual Studio 15 Win64".
fr: Exécutez cmake .. -G "Visual Studio 15 Win64".

source: If you're using Visual Studio 2019,
fr: Si vous utilisez Visual Studio 2019,

source: Run cmake .. -G "Visual Studio 16 2019" -A x64.
fr: Exécutez cmake .. -G "Visual Studio 16 2019" -A x64.

source: Where %VIRCADIA_DIR% is the directory for the Vircadia repository.
fr: Où %VIRCADIA_DIR% est le répertoire du référentiel Vircadia.

source: Step 6. Making a Build
fr: Étape 6. Création d'une Compilation

source: Open %VIRCADIA_DIR%\build\vircadia.sln using Visual Studio.
fr: Ouvrez %VIRCADIA_DIR%\build\vircadia.sln en utilisant Visual Studio.

source: Change the Solution Configuration (menu ribbon under the menu bar, next to the green play button) from "Debug" to "Release" for best performance.
fr: Changez la Configuration de la Solution (ruban de menu sous la barre de menu, à côté du bouton vert de lecture) de "Debug" à "Release" pour une meilleure performance.

source: Run from the menu bar Build > Build Solution.
fr: Exécutez à partir de la barre de menu Build > Build Solution.

source: Step 7. Testing Interface
fr: Étape 7. Tester l'Interface

source: Create another environment variable (see Step #3)
fr: Créez une autre variable d'environnement (voir l'étape 3)

source: Set "Variable name": _NO_DEBUG_HEAP
fr: Définissez "Variable name" : NO_DEBUG_HEAP

source: Set "Variable value": 1
fr: Mettez "Variable value" : 1

source: Restart Visual Studio again.
fr: Redémarrez Visual Studio.

source: In Visual Studio, right+click "interface" under the Apps folder in Solution Explorer and select "Set as Startup Project". Run from the menu bar Debug > Start Debugging.
fr: Dans Visual Studio, faites un clic droit sur "interface" sous le dossier Apps dans l'explorateur de solutions et sélectionnez "Set as Startup Project". Exécutez à partir de la barre de menu Debug > Start Debugging.

source: Now, you should have a full build of Vircadia and be able to run the Interface using Visual Studio.
fr: Maintenant, vous devriez avoir une version complète de Vircadia et être capable d'exécuter l'Interface en utilisant Visual Studio.
