Repository: JulianGro/vircadia-docs-sphinx
Catalog: docs/source/locales/*/LC_MESSAGES/developer.po
Languages: fr

source: Build from Source
fr: Compiler depuis la Source

source: Create an Installer
fr: Créer un Installateur

source: Domain Server
fr: Serveur de Domaine

source: Assignment Client
fr: Client d'Assignation

source: Developer
fr: Développeur

source: Developer information such as how to build the project from source, develop, or technically manage it can be found here.
fr: Les informations destinées aux développeurs, telles que la manière de compiler le projet à partir de la source, de le développer ou de le gérer techniquement, peuvent être trouvées ici.

source: Development Instructions
fr: Instructions de Développement

source: Command Line Parameters
fr: Paramètres de Ligne de Commande

source: You can launch an assignment-client with these parameters.
fr: Vous pouvez lancer un client d'assignation avec ces paramètres.

source: Displays help information
fr: Affiche les informations d'aide

source: Displays version information
fr: Affiche les informations sur la version

source: Assignment client type
fr: Type de client d'assignation

source: 0 = audio-mixer
fr: 0 = mélangeur audio

source: 3 = asset-server
fr: 3 = serveur d'actifs

source: 4 = message-mixer
fr: 4 = mélangeur de messages

source: 5 = entity-script-server
fr: 5 = entité-script-serveur

source: 6 = entity-server
fr: 6 = entité-serveur

source: Assignment pool
fr: Pool d'assignation

source: Assignment client UDP port
fr: Port UDP du client d'assignation

source: Wallet destination
fr: Destination du portefeuille

source: Assignment server hostname
fr: Attribution du nom d'hôte du serveur

source: Assignment server port
fr: Attribution du port du serveur

source: Number of children to fork
fr: Nombre de descendants à alimenter

source: Minimum number of children
fr: Nombre minimum de descendants

source: Maximum number of children
fr: Nombre maximum de descendants

source: Assignment client monitor port
fr: Port de surveillance du client d'assignation

source: HTTP status server port
fr: Port du serveur d'état HTTP

source: Directory to store logs
fr: Répertoire pour le stockage des journaux

source: PID of the parent process
fr: NID de la procédure parentale

source: General Build Information
fr: Informations Générales sur le Système

source: Build Windows
fr: Système Windows

source: Build Linux
fr: Système Linux

source: Build OSX
fr: Système OSX

source: Build Android
fr: Système Android

source: Building Vircadia
fr: Système Vircadia

source: The following are the guides for building Vircadia from source.
fr: Voici les guides pour compiler Vircadia depuis la source.

source: Last Updated on December 21, 2019
fr: Dernière mise à jour le 21 décembre 2019

source: Please read the general build guide for information on building other platforms. Only Android specific instructions are found in this file. Note that these instructions apply to building for Oculus Quest.
fr: Veuillez lire le guide général de compilation pour obtenir des informations sur la compilation pour autres plates-formes. Seules les instructions spécifiques à Android se trouvent dans ce fichier. Veuillez noter que ces instructions s'appliquent à la compilation pour Oculus Quest.

source: Dependencies
fr: Dépendances

source: Building is currently supported on Windows, OSX and Linux, but developers intending to do work on the library dependencies are strongly urged to use 64 bit Linux as a build platform.
fr: La compilation est à ce jour supportée pour Windows, OSX et Linux, mais les développeurs qui ont l'intention de travailler sur les dépendances de la bibliothèque sont vivement encouragés à utiliser Linux 64 bits comme plate-forme de compilation.

source: OS specific dependencies
fr: Dépendances spécifiques pour OS

source: Please install the dependencies for your OS using the Windows, OSX or Linux build instructions before attempting to build for Android.
fr: Veuillez installer les dépendances de votre système d'exploitation en utilisant les instructions de compilation pour Windows, OSX ou Linux avant d'essayer de compiler pour Android.

source: Download the Android Studio installer and run it. Once installed, at the welcome screen, click Configure in the lower right corner and select SDK Manager.
fr: Téléchargez le programme d'installation d'Android Studio et lancez-le. Une fois installé, dans l'écran de bienvenue, cliquez sur Configure dans le coin inférieur droit et sélectionnez SDK Manager.

source: From the SDK Platforms tab, select API levels 26 and 28.
fr: Dans l'onglet Plates-formes SDK, sélectionnez les niveaux d'API 26 et 28.

source: From the SDK Tools tab, select the following
fr: Dans l'onglet Outils du SDK, sélectionnez les éléments suivants

source: NDK (even if you have the NDK installed separately)
fr: NDK (même si vous avez installé le NDK séparément)

source: Still in the SDK Tools tab, click Show Package Details. Select CMake 3.6.4. Do this even if you have a separate CMake installation.
fr: Toujours dans l'onglet SDK Tools, cliquez sur Show Package Details. Sélectionnez CMake 3.6.4. Faites-le même si vous avez une installation séparée de CMake.

source: Also, make sure the NDK installed version is 18 (or higher).
fr: Assurez-vous également que la version de NDK installée est bien la version 18 (ou supérieure).

source: Environment
fr: Environnement

source: Create a keystore in Android Studio
fr: Créer un fichier de clé dans Android Studio

source: Follow the directions here to create a keystore file. You can save it anywhere (preferably not in the hifi folder).
fr: Suivez les instructions ici pour créer un fichier de clé. Vous pouvez l'enregistrer n'importe où (de préférence pas dans le dossier Vircadia).

source: Set up machine specific Gradle properties
fr: Configurer les propriétés Gradle spécifiques à la machine

source: Create a gradle.properties file in the .gradle folder ($HOME/.gradle on Unix, Users/<yourname>/.gradle on Windows). Edit the file to contain the following
fr: Créez un fichier gradle.properties dans le répertoire .gradle ($HOME/.gradle on Unix, Users/<votre nom d'utilisateur>/.gradle sous Windows). Modifiez le fichier de manière à ce qu'il contienne les éléments suivants

source: Note, do not use $HOME for the path. It must be a fully qualified path name. Also, be sure to use forward slashes in your path.
fr: Attention, n'utilisez pas $HOME pour le chemin d'accès. Il doit s'agir d'un nom de chemin d'accès entièrement qualifié. Veillez également à utiliser des barres obliques dans votre chemin d'accès.

source: If you are building for an Android phone
fr: Si vous compilez pour un téléphone Android

source: Add these lines to gradle.properties
fr: Ajouter ces lignes à gradle.properties

source: If you are building for an Oculus Quest
fr: Si vous compilez pour une Oculus Quest

source: The above code to suppress modules is not necessary, but will speed up the build process.
fr: Le code de suppression des modules ci-dessus n'est pas nécessaire, mais il accélérera le processus de compilation.

source: Clone the repository
fr: Cloner le répertoire

source: Building & Running
fr: Compiler & Éxecuter

source: Building Modules
fr: Modules de Compilation

source: Open Android Studio
fr: Ouvrez Android Studio

source: Choose Open an existing Android Studio project
fr: Choisissez Open an existing Android Studio project

source: Navigate to the hifi repository and choose the android folder and select OK
fr: Naviguez vers le répertoire Vircadia, choisissez le dossier android et sélectionnez OK

source: Wait for Gradle to sync (this should take around 20 minutes the first time)
fr: Attendez que Gradle se synchronise (cela devrait prendre environ 20 minutes la première fois)

source: From the Build menu select Make Project
fr: Dans le menu Build, sélectionnez Make Project

source: Running a Module
fr: Exécuter un Module

source: In the toolbar at the top of Android Studio, next to the green hammer icon, you should see a dropdown menu.
fr: Dans la barre d'outils en haut d'Android Studio, à côté de l'icône verte du marteau, vous devriez voir un menu déroulant.

source: You may already see a configuration for the module you are trying to build. If so, select it.
fr: Il se peut que vous voyiez déjà une configuration pour le module que vous essayez de compiler. Si c'est le cas, sélectionnez-la.

source: Otherwise, select Edit Configurations.
fr: Sinon, sélectionnez Edit Configurations.

source: Your configuration should be as follows
fr: Votre configuration devrait être la suivante

source: Module: <your module> (you probably want interface or questInterface)
fr: Module : <votre module> (vous voulez probablement interface ou questInterface)

source: For the interface modules, you also need to select the activity to launch.
fr: Pour les modules d'interface, vous devez également sélectionner l'activité à lancer.

source: For the Android phone interface
fr: Pour l'interface du téléphone Android

source: From the Launch drop down menu, select Specified Activity
fr: Dans le menu déroulant Launch, sélectionnez Specified Activity

source: In the Activity field directly below, put io.highfidelity.hifiinterface.PermissionChecker
fr: Dans le champ Activity directement en dessous, mettez io.highfidelity.hifiinterface.PermissionChecker

source: For the Oculus Quest interface
fr: Pour l'interface de l'Oculus Quest

source: In the Activity field directly below, put io.highfidelity.questInterface.PermissionsChecker
fr: Dans le champActivity directement en dessous, mettez io.highfidelity.questInterface.PermissionsChecker

source: Note the 's' in PermissionsChecker for the Quest.
fr: Notez le 's' dans PermissionsChecker pour la Quest.

source: Now you are able to run your module! Click the green play button in the top toolbar of Android Studio.
fr: Vous pouvez maintenant faire fonctionner votre module ! Cliquez sur le bouton vert de lecture dans la barre d'outils supérieure d'Android Studio.

source: Troubleshooting
fr: Dépannage en cas de Problèmes

source: To view a more complete debug log,
fr: Pour consulter un journal de débogage plus complet,

source: Click the icon with the two overlapping squares in the upper left corner of the tab where the sync is running (hover text says Toggle view)
fr: Cliquez sur l'icône avec les deux carrés qui se chevauchent dans le coin supérieur gauche de l'onglet où la synchronisation est en cours (le texte du survol dit Toggle view)

source: To change verbosity, click File > Settings. Under Build, Execution, Deployment > Compiler you can add command-line flags, as per Gradle documentation
fr: Pour modifier la verbosité, cliquez sur Fichier > Settings. Under Build, Execution, Deployment > Compiler vous pouvez ajouter des options de ligne de commande, conformément à la documentation Gradle

source: Some things you can try if you want to do a clean build
fr: Voici quelques exemples de ce que vous pouvez essayer si vous voulez faire une compilation entièrement nouvelle

source: Delete the build and .externalNativeBuild folders from the folder for each module you're building (for example, hifi/android/apps/interface)
fr: Supprimez les dossiers build et .externalNativeBuild du dossier de chaque module que vous compilez (par exemple, hifi/android/apps/interface)

source: If you have set your HIFI_VCPKG_ROOT environment variable, delete the contents of that directory; otherwise, delete AppData/Local/Temp/hifi
fr: Si vous avez défini votre variable d'environnement HIFI_VCPKG_ROOT, supprimez le contenu de ce répertoire ; sinon, supprimez AppData/Local/Temp/hifi

source: In Android Studio, click File > Invalidate Caches / Restart and select Invalidate and Restart
fr: Dans Android Studio, cliquez sur File > Invalidate Caches / Restart et sélectionnez Invalidate and Restart

source: If you see lots of "couldn't acquire lock" errors,
fr: Si vous constatez de nombreuses erreurs de type "couldn't acquire lock",

source: Open Task Manager and close any running Clang / Gradle processes
fr: Ouvrir le gestionnaire de tâches et fermer les processus Clang / Gradle en cours

source: Last Updated on August 26, 2020
fr: Dernière mise à jour le 26 août 2020

source: OS Specific Build Guides
fr: Guides de compilation spécifiques pour OS

source: Build Windows - complete instructions for Windows.
fr: Compilation Windows - instructions complètes pour Windows.

source: Build Linux - additional instructions for Linux.
fr: Compilation Linux - instructions supplémentaires pour Linux.

source: Build OSX - additional instructions for OS X.
fr: Compilation OSX - instructions supplémentaires pour OS X.

source: Build Android - additional instructions for Android.
fr: Compilation Android - instructions supplémentaires pour Android.

source: Python: 3.6 or higher
fr: Python : 3.6 ou plus haut

source: Used to build the Screen Sharing executable.
fr: Utilisé pour compiler l'exécutable Screen Sharing.

source: CMake External Project Dependencies
fr: CMake Dépendances de Projets Externes

source: These dependencies need not be installed manually. They are automatically downloaded on the platforms where they are required.
fr: Ces dépendances ne doivent pas être installées manuellement. Elles sont automatiquement téléchargées sur les plateformes où elles sont requises.

source: zlib: 1.28 (Win32 only)
fr: zlib : 1.28 (Win32 seulement)

source: nvtt: 2.1.1 (customized)
fr: nvtt : 2.1.1 (personnalisé)

source: The above dependencies will be downloaded, built, linked and included automatically by CMake where we require them. The CMakeLists files that handle grabbing each of the following external dependencies can be found in the cmake/externals folder. The resulting downloads, source files and binaries will be placed in the build/ext folder in each of the subfolders for each external project.
fr: Les dépendances ci-dessus seront téléchargées, construites, liées et incluses automatiquement par CMake là où nous en avons besoin. Les fichiers CMakeLists qui gèrent la saisie de chacune des dépendances externes suivantes se trouvent dans le dossier cmake/externals. Les téléchargements, fichiers sources et binaires résultants seront placés dans le dossier build/ext dans chacun des sous-dossiers pour chaque projet externe.

source: These are not placed in your normal build tree when doing an out of source build so that they do not need to be re-downloaded and re-compiled every time the CMake build folder is cleared. Should you want to force a re-download and re-compile of a specific external, you can simply remove that directory from the appropriate subfolder in build/ext. Should you want to force a re-download and re-compile of all externals, just remove the build/ext folder.
fr: Ils ne sont pas placés dans votre arborescence de compilation normale lorsque vous effectuez une compilation hors source, de sorte qu'ils ne doivent pas être retéléchargés et recompilés chaque fois que le dossier de compilation de CMake est vidé. Si vous souhaitez forcer un re-téléchargement et une recompilation d'un projet externe spécifique, vous pouvez simplement supprimer ce répertoire du sous-dossier approprié dans build/ext. Si vous voulez forcer un re-téléchargement et une recompilation de tous les externes, il suffit de supprimer le dossier build/ext.

source: Vircadia uses CMake to generate build files and project files for your platform.
fr: Vircadia utilise CMake pour générer des fichiers de compilation et des fichiers de projet pour votre plate-forme.

source: CMake will download Qt 5.12.3 using vcpkg.
fr: CMake téléchargera Qt 5.12.3 en utilisant vcpkg.

source: To override this (i.e. use an installed Qt configuration - you will need to set a QT_CMAKE_PREFIX_PATH environment variable pointing to your Qt lib/cmake folder.<br />This can either be entered directly into your shell session before you build or in your shell profile (e.g.: ~/.bash_profile, ~/.bashrc, ~/.zshrc - this depends on your shell and environment). The path it needs to be set to will depend on where and how Qt5 was installed. e.g.
fr: Pour passer outre (c'est-à-dire utiliser une configuration Qt installée - vous devrez définir une variable d'environnement QT_CMAKE_PREFIX_PATH pointant sur votre dossier Qt lib/cmake.<br /> Cela peut être entré soit directement dans votre session shell avant la compilation, soit dans votre profil shell (par ex : ~/.bash_profile, ~/.bashrc, ~/.zshrc - cela dépend de votre shell et de votre environnement). Le chemin d'accès à Qt5 dépend de l'endroit et de la manière dont il a été installé, par exemple.

source: Vircadia uses vcpkg to download and build dependencies. You do not need to install vcpkg.
fr: Vircadia utilise vcpkg pour télécharger et créer des dépendances. Vous n'avez pas besoin d'installer vcpkg.

source: Building the dependencies can be lengthy and the resulting files will be stored in your OS temp directory. However, those files can potentially get cleaned up by the OS, so in order to avoid this and having to redo the lengthy build step, you can set the following environment variable:
fr: La création des dépendances peut être longue et les fichiers résultants seront stockés dans le répertoire temporaire de votre système d'exploitation. Cependant, ces fichiers peuvent potentiellement être nettoyés par le système d'exploitation, donc pour éviter cela et devoir refaire la longue étape de compilation, vous pouvez définir la variable d'environnement suivante :

source: Where /path/to/directory is the path to a directory where you wish the build files to get stored.
fr: Où /path/to/directory est le chemin d'accès à un répertoire où vous souhaitez que les fichiers de compilation soient stockés.

source: Generating Build Files
fr: Génération des Fichiers de Compilation

source: Possible Environment Variables
fr: Variables Environnementales Possibles

source: Generate Files
fr: Générer des Fichiers

source: Create a build directory in the root of your checkout and then run the CMake build from there. This will keep the rest of the directory clean.
fr: Créez un répertoire de compilation dans le root de votre checkout et lancez ensuite la compilation CMake à partir de là. Cela permettra de garder le reste du répertoire propre.

source: If CMake gives you the same error message repeatedly after the build fails, try removing CMakeCache.txt.
fr: Si CMake vous donne le même message d'erreur à plusieurs reprises après l'échouement de la compilation, essayez de supprimer CMakeCache.txt.

source: Generating a release/debug only vcpkg build
fr: Génération d'une compilation vcpkg uniquement pour release/débogage

source: In order to generate a release or debug only vcpkg package, you could use the use the VCPKG_BUILD_TYPE define in your cmake generate command. Building a release only vcpkg can drastically decrease the total build time.
fr: Afin de générer un paquet vcpkg pour release ou débogage uniquement, vous pouvez utiliser VCPKG_BUILD_TYPE dans votre ligne de commande cmake. Créer un vcpkg pour release uniquement peut réduire considérablement le temps total de compilation.

source: For release only vcpkg:
fr: Vcpkg pour release seulement :

source: For debug only vcpkg:
fr: Vcpkg pour le débogage seulement :

source: Any variables that need to be set for CMake to find dependencies can be set as ENV variables in your shell profile, or passed directly to CMake with a -D flag appended to the cmake .. command.
fr: Toutes les variables qui doivent être définies pour que CMake puisse trouver des dépendances peuvent être définies comme des variables ENV dans votre profil shell, ou passées directement à CMake avec une option -D ajouté à la commande cmake.

source: For example, to pass the QT_CMAKE_PREFIX_PATH variable (if not using the vcpkg'ed version) during build file generation:
fr: Par exemple, pour passer la variable QT_CMAKE_PREFIX_PATH (si vous n'utilisez pas la version vcpkg'ed) lors de la génération du fichier de compilation :

source: Finding Dependencies
fr: Recherche de Dépendances

source: The following applies for dependencies we do not grab via CMake ExternalProject (OpenSSL is an example), or for dependencies you have opted not to grab as a CMake ExternalProject (via -DUSE_LOCAL_$NAME=0). The list of dependencies we grab by default as external projects can be found in the CMake External Project Dependencies section.
fr: Ce qui suit s'applique aux dépendances que nous ne saisissons pas via CMake ExternalProject (OpenSSL est un exemple), ou aux dépendances que vous avez choisi de ne pas saisir en tant que CMake ExternalProject (via -DUSE_LOCAL_$NAME=0). La liste des dépendances que nous saisissons par défaut en tant que projets externes se trouve dans la section CMake External Project Dependencies.

source: You can point our CMake find modules to the correct version of dependencies by setting one of the three following variables to the location of the correct version of the dependency.
fr: Vous pouvez pointer nos modules de recherche CMake vers la version correcte des dépendances en définissant l'une des trois variables suivantes à l'emplacement de la version correcte de la dépendance.

source: In the examples below the variable $NAME would be replaced by the name of the dependency in uppercase, and $name would be replaced by the name of the dependency in lowercase (ex: OPENSSL_ROOT_DIR, openssl).
fr: Dans les exemples ci-dessous, la variable $NAME sera remplacée par le nom de la dépendance en majuscule, et $name sera remplacé par le nom de la dépendance en minuscule (ex : OPENSSL_ROOT_DIR, openssl).

source: $NAME_ROOT_DIR - pass this variable to Cmake with the -DNAME_ROOT_DIR= flag when running Cmake to generate build files
fr: $NAME_ROOT_DIR - passer cette variable à Cmake avec l'option -DNAME_ROOT_DIR= lors de l'exécution de Cmake pour générer les fichiers de compilation

source: $NAME_ROOT_DIR - set this variable in your ENV
fr: $NAME_ROOT_DIR - définissez cette variable dans votre ENV

source: HIFI_LIB_DIR - set this variable in your ENV to your Vircadia lib folder, should contain a folder '$name'
fr: HIFI_LIB_DIR - Définissez cette variable dans votre ENV pour votre dossier Vircadia lib, qui doit contenir un dossier '$name'

source: Optional Components
fr: Composantes Optionnelles

source: Build Options
fr: Options de Compilation

source: The following build options can be used when running CMake
fr: Les options de compilation suivantes peuvent être utilisées lors de l'exécution de CMake

source: CLIENT_ONLY // Will package only the Interface
fr: CLIENT_ONLY // N'empaquetera que l'Interface

source: SERVER_ONLY // Will package only the Server
fr: SERVER_ONLY // N'empaquetera que le Serveur

source: Developer Build Options
fr: Options de Compilation pour les Développeurs

source: Devices
fr: Périphériques

source: You can support external input/output devices such as Leap Motion, MIDI, and more by adding each individual SDK in the visible building path. Refer to the readme file available in each device folder in interface/external/ for the detailed explanation of the requirements to use the device.
fr: Vous pouvez prendre en charge des périphériques d'entrée/sortie externes tels que la Leap Motion, le MIDI, et bien d'autres en ajoutant chaque SDK individuel dans le chemin d'accès visible de compilation. Reportez-vous au fichier readme disponible dans chaque dossier de périphérique dans interface/external/ pour une explication détaillée des conditions d'utilisation du périphérique.

source: Last Updated on December 1, 2020
fr: Dernière mise à jour le 1er décembre 2020
