Repository: JulianGro/vircadia-docs-sphinx
Catalog: docs/source/locales/*/LC_MESSAGES/faq.po
Languages: fr

source: Frequently Asked Questions
fr: Foire Aux Questions

source: We get a lot of questions from our users! If you have questions about Vircadia, feel free to browse through this page to learn more.
fr: Nous recevons beaucoup de questions de la part de nos utilisateurs ! Si vous avez des questions sur Vircadia, n'hésitez pas à parcourir cette page pour en savoir plus.

source: On This Page
fr: Sur Cette Page

source: Content Creation
fr: Création de Contenu

source: `What video codecs do you support? <#video-codecs>`_
fr: `Quels codecs vidéo sont supportés ? <#video-codecs>`_

source: What video codecs do you support?
fr: Quels sont les codecs vidéo que vous soutenez ?

source: We support the following video codecs:
fr: Nous supportons les vidéo codecs suivant :

source: Domain Hosting
fr: Hébergement de Domaines

source: `How do I get into my domain settings if I set up authentication but forgot my username and/or password? <#reset-password>`_
fr: `Comment accéder aux paramètres de mon domaine si j'ai configuré l'authentification mais que j'ai oublié mon nom d'utilisateur et/ou mon mot de passe ? <#reset-password>`_

source: How do I get into my domain settings if I set up `authentication <host/configure-settings/authentication-setting.html>`_ but forgot my username and/or password?
fr: Comment puis-je accéder aux paramètres de mon domaine si je mets en place une `authentification <host/configure-settings/authentication-setting.html>`_ mais j'ai oublié mon nom d'utilisateur et/ou mon mot de passe ?

source: The authentication settings for your domain are encrypted into a configuration file on the server's file system. To 'reset' the authentication settings, you need to manually remove the HTTP security settings ('http_password' and 'http_username') from config.json. The config file is stored on the server in the following directories:
fr: Les paramètres d'authentification de votre domaine sont cryptés dans un fichier de configuration sur le système de fichiers du serveur. Pour 'réinitialiser' les paramètres d'authentification, vous devez supprimer manuellement les paramètres de sécurité HTTP ('http_password' et 'http_username') du fichier config.json. Le fichier config est stocké sur le serveur dans les répertoires suivants :

source: Troubleshooting
fr: Dépannage en cas de Problèmes

source: `Why can't I connect to a domain? <#cannot-connect>`_
fr: `Pourquoi ne puis-je pas me connecter à un domaine ? <#cannot-connect>`_

source: `No one can hear me! <#no-input>`_
fr: `Personne ne peut m'entendre ! <#no-input>`_

source: `I can't hear anything in Vircadia <#no-output>`_
fr: `Je n'entends rien dans Vircadia <#no-output>`_

source: Why can't I connect to a domain?
fr: Pourquoi ne puis-je pas me connecter à un domaine ?

source: If you cannot connect to your virtual workplace, follow these steps to resolve the issue:
fr: Si vous ne pouvez pas vous connecter à votre lieu de travail virtuel, suivez les étapes suivantes pour résoudre le problème :

source: Check your internet connection, and ensure that your bandwidth is at least 10Mbps download, 2Mbps upload.
fr: Vérifiez votre connexion internet et assurez-vous que votre bande passante est d'au moins 10 Mbps en téléchargement et 2 Mbps en émission.

source: You may not have permissions to enter the domain. If you know the domain owner, contact them to gain access to the domain.
fr: Il se peut que vous n'ayez pas les autorisations nécessaires pour entrer dans le domaine. Si vous connaissez le propriétaire du domaine, contactez-le pour avoir accès au domaine.

source: Ensure that your firewall settings allow you to run Vircadia.
fr: Assurez-vous que les paramètres de votre pare-feu vous permettent d'exécuter Vircadia.

source: For Windows: In your firewall settings, open the port 40102, and add 'interface.exe' to the list of allowed apps.
fr: Pour Windows : Dans les paramètres de votre pare-feu, ouvrez le port 40102 et ajoutez "interface.exe" à la liste des applications autorisées.

source: For Mac: In your firewall settings, add 'interface.app' (**Library > Application Support > Launcher > interface.app**) and allow incoming connections for that application.
fr: Pour Mac : Dans les paramètres de votre pare-feu, ajoutez 'interface.app' (**Library > Application Support > Launcher > interface.app**) et permettre les connexions entrantes pour cette application.

source: No one can hear me!
fr: Personne ne peut m'entendre !

source: If other users in the domain can't hear you, then you are likely muted or your microphone gain is set too low. Here are some steps to troubleshoot your issue:
fr: Si les autres utilisateurs du domaine ne peuvent pas vous entendre, alors vous êtes probablement en mode silencieux ou le gain de votre microphone est réglé trop bas. Voici quelques étapes pour résoudre votre problème :

source: **Are you muted in Vircadia?** When logged in, check the upper left corner. If you're muted, click the microphone to un-mute yourself.
fr: **Êtes-vous muet dans Vircadia ?**Lorsque vous êtes connecté, vérifiez le coin supérieur gauche. Si vous êtes en mode muet, cliquez sur le microphone pour réactiver le microphone.

source: **Is your physical output device muted or turned off?** Some headsets and microphones have a 'Power' and/or 'Mute' switch directly on the device itself. This setting is completely independent of Vircadia's mute option, so even if you're not muted in Vircadia, your device itself may not be turned on or the mute button may have been pressed.
fr: **Votre périphérique de sortie physique est-il mis en sourdine ou éteint ?**Certains casques et microphones ont un interrupteur 'Power' et/ou 'Mute' directement sur l'appareil lui-même. Ce réglage est complètement indépendant de l'option 'Mute' de Vircadia, donc même si vous n'êtes pas en mode 'Mute' en Vircadia, votre appareil peut ne pas être allumé ou le bouton 'Mute' peut avoir été enfoncé.

source: **Is your mic muted or disabled on your computer?** Lastly, your device might be muted or disabled by your operating system. Check your operating system's input device settings:
fr: **Votre micro est-il coupé ou désactivé sur votre ordinateur ?**Enfin, il se peut que votre appareil soit mis en sourdine ou désactivé par votre système d'exploitation. Vérifiez les paramètres du périphérique d'entrée de votre système d'exploitation :

source: On Windows, go to **Control Panel > Sound > Recording** tab. Choose the device you are using with Vircadia and click 'Properties'. On the 'Levels' tab, check the icon next to the volume meter. The microphone icon will tell you whether your headset/microphone is muted. If you're muted, click the icon to un-mute yourself.
fr: Sous Windows, allez dans le **Panneau de configuration > Son > onglet Enregistrement**. Choisissez le périphérique que vous utilisez avec Vircadia et cliquez sur "Propriétés". Dans l'onglet "Niveaux", cochez l'icône à côté du compteur de volume. L'icône du microphone vous indiquera si votre casque/microphone est coupé. Si vous êtes en mode silencieux, cliquez sur l'icône pour activer le microphone.

source: On Mac, go to **System Preferences > Sound > Input** tab. Choose the device you are using with Vircadia. If the 'Input volume' is turned all of the way down, then your input device is disabled. Turn up the input volume to re-enable your microphone.
fr: Sur Mac, allez dans **Préférences système > Son > onglet Entrée**. Choisissez l'appareil que vous utilisez avec Vircadia. Si le 'Volume d'entrée' est réglé au minimum, votre périphérique d'entrée est désactivé. Augmentez le volume d'entrée pour réactiver votre microphone.

source: **Have you allowed Vircadia access to the microphone?** Some operating systems require you to give explicit permission to apps to take advantage of specific hardware or software capabilities on your computer. Check your microphone permissions in your operating system settings:
fr: **Avez-vous autorisé Vircadia à accéder au microphone ?** Certains systèmes d'exploitation exigent que vous donniez une autorisation explicite aux applications pour accéder aux capacités du matériel informatique ou de logiciels spécifiques sur votre ordinateur. Vérifiez les autorisations de votre microphone dans les paramètres de votre système d'exploitation :

source: On Windows, go to **Settings > Privacy > Microphone**. Make sure that 'Allow desktop apps to access your microphone' is turned on.
fr: Sur Windows, allez à **Paramètres > Vie privée > Microphone**. Assurez-vous que l'option 'Autoriser les applications en mode Clavier à accéder à votre microphone' est activée.

source: On Mac, go to **System Preferences > Security & Privacy > Privacy**, then select 'Microphone'. Ensure that the checkbox next to Vircadia is selected.
fr: Sur Mac, allez dans **Préférences système > Sécurité et Confidentialité > Confidentialité**, puis sélectionnez 'Microphone'. Assurez-vous que la case à cocher à côté de Vircadia est sélectionnée.

source: If your input device is turned on, and you are not muted in the application, device, or operating system, then it is likely that your microphone volume needs to be adjusted or boosted. This is done in your operating system settings:
fr: Si votre périphérique d'entrée est allumé et que vous n'êtes pas en mode silencieux dans l'application, le périphérique ou le système d'exploitation, il est probable que le volume de votre microphone doit être ajusté ou augmenté. Cela se fait dans les paramètres de votre système d'exploitation :

source: On Windows, go to **Control Panel > Sound > Recording** tab. Choose the device you are using with Vircadia and click 'Properties'. On the 'Levels' tab, adjust the 'Microphone Level' and/or 'Microphone Boost'.
fr: Sous Windows, allez dans le **Panneau de configuration > Son > onglet Enregistrement**. Choisissez le périphérique que vous utilisez avec Vircadia et cliquez sur 'Propriétés'. Dans l'onglet 'Niveaux', réglez le 'Niveau du microphone' et/ou le 'Boost du microphone'.

source: On Mac, go to **System Preferences > Sound > Input** tab. Choose the device you are using with Vircadia and adjust the 'Input volume'.
fr: Sur Mac, allez dans **Préférences système > Son > onglet Entrée**. Choisissez l'appareil que vous utilisez avec Vircadia et réglez le 'Volume d'entrée'.

source: I can't hear anything in Vircadia.
fr: Je n'entends rien dans Vircadia.

source: Here are some reasons you might not have audio:
fr: Voici quelques raisons pour lesquelles vous n'avez peut-être pas de son :

source: Your headset or speakers are turned off.
fr: Votre casque ou vos haut-parleurs sont éteints.

source: Your headset or speakers may be muted or disabled by your operating system. Check your operating system's output device settings:
fr: Votre casque ou vos haut-parleurs peuvent être mis en sourdine ou désactivés par votre système d'exploitation. Vérifiez les paramètres des périphériques de sortie de votre système d'exploitation :

source: On Windows, click the volume icon in the taskbar and select your audio device. The speaker icon will tell you whether or not your headset or speakers are disabled. Click the icon to un-mute yourself.
fr: Sous Windows, cliquez sur l'icône du volume dans la barre des tâches et sélectionnez votre périphérique audio. L'icône de haut-parleur vous indiquera si votre casque ou vos haut-parleurs sont désactivés ou non. Cliquez sur l'icône pour rétablir le son.

source: On Mac, go to **System Preferences > Sound > Output** tab. Choose the device you are using with Vircadia. At the bottom of the dialog, uncheck 'Mute' to un-mute yourself.
fr: Sur Mac, allez dans **Préférences système > Son > onglet Sortie**. Choisissez l'appareil que vous utilisez avec Vircadia. En bas de la boîte de dialogue, décochez la case 'Mute' pour rétablir le son.

source: Your headset or speakers have a volume control of their own. Check that the volume is turned up on the device.
fr: Votre casque ou vos haut-parleurs ont leur propre réglage de volume. Vérifiez que le volume est bien réglé sur l'appareil.

source: In Vircadia, you have a different audio device selected than the one you want to use. Open the **Audio** app and make sure the right headset, speakers, and/or microphone are selected.
fr: Dans Vircadia, vous avez choisi un appareil audio différent de celui que vous voulez utiliser. Ouvrez l'application **Audio** et assurez-vous que le bon casque, les bons haut-parleurs et/ou le bon microphone sont sélectionnés.

source: Volume is turned down or off in Vircadia. Open the **Audio** app and check your volume settings.
fr: Dans Vircadia, le volume est baissé ou coupé. Ouvrez l'application **Audio** et vérifiez vos paramètres de volume.
